# GetUnitTypeId Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssetPropertyDistance..::..GetUnitTypeId Method
AssetPropertyDistance Class See Also
---
Gets the identifier of the unit quantifying the distance property.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ForgeTypeId GetUnitTypeId()
```

Visual Basic
---
```text
Public Function GetUnitTypeId As ForgeTypeId
```

Visual C++
---
```text
public:
ForgeTypeId^ GetUnitTypeId()
```

# See Also
AssetPropertyDistance Class
Autodesk.Revit.DB.Visual Namespace